nathanlnw/tw705_nx_gsm_v1.0/bsp/stm32f207VC_tw705/app_712/protocol_808/Device_808.c
/*
     Device_808.C       和808   协议相关的 I/O 管脚配置
*/

#include <rtthread.h>
#include <rthw.h>
#include "stm32f2xx.h"
#include "usart.h"
#include "board.h"
#include <serial.h>

#include  <stdlib.h>
#include  <stdio.h>
#include  <string.h>
#include "App_moduleConfig.h"


#define ADC1_DR_Address  ((uint32_t)0X4001204C)

u16 ADC_ConValue[3];   //   3  个通道ID    0 : 电池 1: 灰线   2:  绿线
u16   AD_2through[2]; //  另外2 路AD 的数值


u8  HardWareVerion = 0; //   硬件版本检测
//-----  WachDog related----
u8    wdg_reset_flag = 0;  //  Task Idle Hook 相关
u32   TIM3_Timer_Counter = 0; //  测试定时器计数器
u32   TIM3_OneSecondCounter = 0;

//--------  电压检测 相关 ---------------------------------
AD_POWER  Power_AD;



u32  IC2Value = 0; //
u32  DutyCycle	= 0;





//------------  AD    电压相关  --------------------
void AD_PowerInit(void)
{
    Power_AD.ADC_ConvertedValue = 0; //电池电压AD数值
    Power_AD.AD_Volte = 0;    // 采集到的实际电压数值
    Power_AD.Classify_Door = 160; //  区分大车小车类型，  >16V  大型车 <16V 小型车
    Power_AD.LowWarn_Limit_Value = 10; //  欠压报警门限值
    Power_AD.LowPowerCounter = 0;
    Power_AD.CutPowerCounter = 0;
    Power_AD.PowerOK_Counter = 0;
    Power_AD.Battery_Flag = 0;
}

//------- 电压检测----
void  Voltage_Checking(void)
{
    //----------------------
    //------------- 电源电压AD显示 -----------------------
    Power_AD.ADC_ConvertedValue = ADC_ConValue[0];
    Power_AD.AD_Volte = ((Power_AD.ADC_ConvertedValue * 543) >> 12);
    //  ---电源欠压报警----
    Power_AD.AD_Volte = Power_AD.AD_Volte + 11;

    //  -----  另外2 路	AD 的采集电压值转换
    // 1 .through  1  Voltage Value
    AD_2through[0] = (((ADC_ConValue[1] - 70) * 543) >> 12);
    AD_2through[0] = AD_2through[0] + 11 + 10;
    AD_2through[0] = AD_2through[0] * 100; // mV
    // 2 .through  2  Voltage Value
    AD_2through[1] = (((ADC_ConValue[2] - 70) * 543) >> 12);
    AD_2through[1] = AD_2through[1] + 11 + 10;
    AD_2through[1] = AD_2through[1] * 100;


    //------------外部断电---------------------
    if(Power_AD.AD_Volte < 80) //  小于50 认为是外部断电
    {
        Power_AD.PowerOK_Counter = 0;
        Power_AD.CutPowerCounter++;
        if(Power_AD.CutPowerCounter > 2)
        {
            Power_AD.CutPowerCounter = 0;
            Power_AD.LowPowerCounter = 0;

            //------ 超级电容	为高则 启动了
            if(Power_AD.Battery_Flag == 0)
            {
                //  1.  正常操作
                //rt_kprintf("\r\n POWER CUT \r\n");
                Power_AD.Battery_Flag = 1;
                MainPower_cut_process();
                PositionSD_Enable();
                Current_UDP_sd = 1;

                // 2.	 GB19056 相关
                //  事故疑点2	   : 外部断电触发事故疑点存储
                moni_drv(0x10, 7);
                //save 断电记录
                VDR_product_13H(0x02);
                //-------------------------------------------------------
            }
            //--------------------------------
        }

    }
    else
    {

        //    电源正常情况下
        Power_AD.CutPowerCounter = 0;
        if(Power_AD.Battery_Flag == 1)
        {
            Power_AD.PowerOK_Counter++;
            if(Power_AD.PowerOK_Counter > 10000)
            {
                // 1 .	正常操作
                Powercut_Status = 0x01;
                MainPower_Recover_process();
                // rt_kprintf("\r\n POWER OK!\r\n");
                Power_AD.Battery_Flag = 1;
                PositionSD_Enable();
                Current_UDP_sd = 1;
                // GB19056	相关
                //  电源恢复正常记录
                VDR_product_13H(0x01);
                //-------------------------------------------------------
                Power_AD.PowerOK_Counter = 0;
                Power_AD.Battery_Flag = 0;
            }
        }

        //------------判断欠压和正常-----
        // 根据采集到的电压区分电瓶类型，修改欠压门限数值
        if(Power_AD.AD_Volte <= 160) 	// 16V
            Power_AD.LowWarn_Limit_Value = 100; // 小于16V  认为是小车 ，欠压门限是10V
        else
            Power_AD.LowWarn_Limit_Value = 170; // 大于16V  认为是大车 ，欠压门限是17V



        if(Power_AD.AD_Volte < Power_AD.LowWarn_Limit_Value)
        {
            if((Warn_Status[3] & 0x80) == 0x00)
            {
                Power_AD.LowPowerCounter++;
                if(Power_AD.LowPowerCounter > 8)
                {
                    Power_AD.LowPowerCounter = 0;
                    Warn_Status[3] |= 0x80; //欠压报警
                    PositionSD_Enable();
                    Current_UDP_sd = 1;
                    if(GB19056.workstate == 0)
                        rt_kprintf("\r\n 欠压! \r\n");
                }
            }
        }
        else
        {
            if(((Warn_Status[3] & 0x80) == 0x80) && (GB19056.workstate == 0))
                rt_kprintf("\r\n 欠压还原! \r\n");

            Power_AD.LowPowerCounter = 0;
            Warn_Status[3] &= ~0x80; //取消欠压报警
        }

        //---------------------------------------
    }

}

u8  HardWareGet(void)
{
    //  获取硬件版本信息
    // -----    硬件版本状态监测 init  ----------------------
    /*
    PA13	1	复用硬件版本判断
    PA14	1	复用硬件版本判断
    PB3       0	复用硬件版本判断
     */
    u8   Value = 0;

    //-----------------------------------------------------------
    if(GPIO_ReadInputDataBit(GPIOA, GPIO_Pin_13)) // bit 2
        Value |= 0x04;
    else
        Value &= ~0x04;
    //----------------------------------------------------------
    if(GPIO_ReadInputDataBit(GPIOA, GPIO_Pin_14)) // bit 1
        Value |= 0x02;
    else
        Value &= ~0x02;
    //------------------------------------------------------------
    if(GPIO_ReadInputDataBit(GPIOB, GPIO_Pin_3)) // bit0
        Value |= 0x01;
    else
        Value &= ~0x01;
    //------------------------------------------------------------
    rt_kprintf("\r\n  硬件版本读取: %2X", Value);
    return Value;
}
//FINSH_FUNCTION_EXPORT(HardWareGet, HardWareGet);


void WatchDog_Feed(void)
{
    if(wdg_reset_flag == 0)
        IWDG_ReloadCounter();
}

void  reset(void)
{
    IWDG_SetReload(0);
    IWDG->KR = 0x00001;  //not regular
    wdg_reset_flag = 1;
}
FINSH_FUNCTION_EXPORT(reset, ststem reset);
void WatchDogInit(void)
{
    /* IWDG timeout equal to 250 ms (the timeout may varies due to LSI frequency
       dispersion) */
    /* Enable write access to IWDG_PR and IWDG_RLR registers */
    IWDG_WriteAccessCmd(IWDG_WriteAccess_Enable);

    /* IWDG counter clock: LSI/32 */
    /*   prescaler            min/ms    max/ms
         4                        0.1             409.6
         8                        0.2             819.2
         16                      0.4             1638.4
         32                      0.8              3276.8
         64                      1.6              6553.5
         128                    3.2              13107.2
         256                    6.4              26214.4
    */
    IWDG_SetPrescaler(IWDG_Prescaler_16);

    /* Set counter reload value to obtain 250ms IWDG TimeOut.
       Counter Reload Value = 250ms/IWDG counter clock period
                            = 250ms / (LSI/32)
                            = 0.25s / (LsiFreq/32)
                            = LsiFreq/(32 * 4)
                            = LsiFreq/128
     */
    IWDG_SetReload(0X4AAA);//(LsiFreq/128);

