nathanlnw/tw705_nx_gsm_v1.0/bsp/stm32f207VC_tw705/app_712/protocol_808/Device_808.c
    /* Reload IWDG counter */
    IWDG_ReloadCounter();

    /* Enable IWDG (the LSI oscillator will be enabled by hardware) */
    IWDG_Enable();
}

void  APP_IOpinInit(void)   //初始化 和功能相关的IO 管脚
{
    GPIO_InitTypeDef        gpio_init;

    RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOA, ENABLE);
    RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOB, ENABLE);
    RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOC, ENABLE);
    RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOE, ENABLE);

    gpio_init.GPIO_Mode = GPIO_Mode_AF;
    gpio_init.GPIO_Speed = GPIO_Speed_100MHz;
    gpio_init.GPIO_OType = GPIO_OType_PP;
    gpio_init.GPIO_PuPd  = GPIO_PuPd_NOPULL;
    // 		IN
    //------------------- PE8 -----------------------------
    gpio_init.GPIO_Pin	 = GPIO_Pin_8;	  //紧急报警
    gpio_init.GPIO_Mode  = GPIO_Mode_IN;
    GPIO_Init(GPIOE, &gpio_init);
    //------------------- PE9 -----------------------------
    gpio_init.GPIO_Pin	 = GPIO_Pin_9;				//------ACC  状态
    gpio_init.GPIO_Mode  = GPIO_Mode_IN;
    GPIO_Init(GPIOE, &gpio_init);
    //------------------- PE7 -----------------------------
    gpio_init.GPIO_Pin	 = GPIO_Pin_7;				//------车门开关状态  0 有效  常态下为高
    gpio_init.GPIO_Mode  = GPIO_Mode_IN;   //如果只接刹车，那就用PE5当刹车监视
    GPIO_Init(GPIOE, &gpio_init);

    //	OUT

    //------------------- PB1 -----------------------------
    gpio_init.GPIO_Pin	= GPIO_Pin_1;   //------未定义   输出 常态置0
    gpio_init.GPIO_Mode	= GPIO_Mode_OUT;
    GPIO_Init(GPIOB, &gpio_init);

    //------------------- PD9 -----------------------------
    gpio_init.GPIO_Pin	= GPIO_Pin_9;   // 功放
    gpio_init.GPIO_Mode	= GPIO_Mode_OUT;
    GPIO_Init(GPIOD, &gpio_init);
    Speak_OFF;
    //====================================================================
    //-----------------------写继电器常态下的情况------------------
    // GPIO_ResetBits(GPIOB,GPIO_Pin_1);	 //输出常态 置 0
    GPIO_SetBits(GPIOB, GPIO_Pin_1);	 //输出常态 置 0

    // GPIO_ResetBits(GPIOA,GPIO_Pin_13);	 // 关闭蜂鸣器
    /*
         J1 接口 初始化
    */
    //------------- PC0 --------------
    gpio_init.GPIO_Pin	 = GPIO_Pin_0;				//------PIN 4    远光灯
    gpio_init.GPIO_Mode  = GPIO_Mode_IN;
    GPIO_Init(GPIOC, &gpio_init);
    //------------- ----------------
    gpio_init.GPIO_Pin	 = GPIO_Pin_1;				//------PIN 5   预留  车门灯
    gpio_init.GPIO_Mode  = GPIO_Mode_IN;
    GPIO_Init(GPIOC, &gpio_init);
    //------------- PA1 --------------
    gpio_init.GPIO_Pin	 = GPIO_Pin_1;				//------PIN 6   喇叭
    gpio_init.GPIO_Mode  = GPIO_Mode_IN;
    GPIO_Init(GPIOA, &gpio_init);
    //------------- PC3 --------------
    gpio_init.GPIO_Pin	 = GPIO_Pin_3;				//------PIN 7   左转灯
    gpio_init.GPIO_Mode  = GPIO_Mode_IN;
    GPIO_Init(GPIOC, &gpio_init);
    //------------- PC2 --------------
    gpio_init.GPIO_Pin	 = GPIO_Pin_2;				//------PIN 8   右转灯
    gpio_init.GPIO_Mode  = GPIO_Mode_IN;
    GPIO_Init(GPIOC, &gpio_init);

    //------------- PE11 --------------
    gpio_init.GPIO_Pin	 = GPIO_Pin_11;				//------PIN 9   刹车灯
    gpio_init.GPIO_Mode  = GPIO_Mode_IN;
    GPIO_Init(GPIOE, &gpio_init);
    //------------- PE10 --------------
    gpio_init.GPIO_Pin	 = GPIO_Pin_10;				//------PIN 10  雨刷
    gpio_init.GPIO_Mode  = GPIO_Mode_IN;
    GPIO_Init(GPIOE, &gpio_init);

    //-----------------------------------------------------------------

#if 1
    // -----    硬件版本状态监测 init  ----------------------
    /*
    PA13	1	复用硬件版本判断
    PA14	1	复用硬件版本判断
    PB3       0	复用硬件版本判断
     */
    //------------- PA13 --------------
    gpio_init.GPIO_Pin	 = GPIO_Pin_13;
    gpio_init.GPIO_Mode  = GPIO_Mode_IN;
    GPIO_Init(GPIOA, &gpio_init);

    //------------- PA14 --------------
    gpio_init.GPIO_Pin	 = GPIO_Pin_14;
    gpio_init.GPIO_Mode  = GPIO_Mode_IN;
    GPIO_Init(GPIOA, &gpio_init);
    //------------- PB3 --------------
    gpio_init.GPIO_Pin	 = GPIO_Pin_3;
    gpio_init.GPIO_Mode  = GPIO_Mode_IN;
    GPIO_Init(GPIOB, &gpio_init);
#endif

}

/*
     -----------------------------
    1.    输入管脚状态监测
     -----------------------------
*/
u8  ACC_StatusGet(void)
{
    // ACC 状态引脚
    //返回  非0 为  ACC 开
    //返回  0  为   ACC 关
    return(!GPIO_ReadInputDataBit(ACC_IO_Group, ACC_Group_NUM));
}

u8  WARN_StatusGet(void)
{
    // 紧急报警 状态引脚
    //返回  非0 为  报警按钮按下
    //返回  0  为   报警按钮断开
    return (!GPIO_ReadInputDataBit(WARN_IO_Group, WARN_Group_NUM));
}
u8  MainPower_cut(void)
{
    // 断电报警 状态引脚
    //返回  非0 为  主电断开
    //返回  0  为   主电工作
    // return (GPIO_ReadInputDataBit(POWER_IO_Group,POWER_Group_NUM)&0x01) ;
    return false;
}

//-------------------------------------------------------------------------------------------------
u8  BreakLight_StatusGet(void)
{
    //	--------------J1pin8	PE11	         刹车灯------> 棕
    return(!GPIO_ReadInputDataBit(BREAK_IO_Group, BREAK_Group_NUM));	//PE11
    //		 接高  触发
}
u8  LeftLight_StatusGet(void)
{
    //  --------------J1pin10	   PE10		   左转灯------>红
    return (!GPIO_ReadInputDataBit(LEFTLIGHT_IO_Group, LEFTLIGHT_Group_NUM));	//	PE10
    //		 接高  触发
}
u8  RightLight_StatusGet(void)
{
    //	--------------J1pin8   PC2			  右转灯------>白
    return(!GPIO_ReadInputDataBit(RIGHTLIGHT_IO_Group, RIGHTLIGHT_Group_NUM)); //PC2
    //	   接高  触发
}

u8  FarLight_StatusGet(void)
{
    //  --------------J1pin4		PC0	           远光灯-----> 黑
    return (!GPIO_ReadInputDataBit(FARLIGHT_IO_Group, FARLIGHT_Group_NUM));	// PC0
    //		 接高  触发
}
u8  NEARLight_StatusGet(void)
{
    //  --------------J1pin5		PA6	          近光灯------>  黄
    return (!GPIO_ReadInputDataBit(NEARLIGHT_IO_Group, NEARLIGHT_Group_NUM));	// PA6
    //		 接高  触发
}

u8 FOGLight_StatusGet(void)
{
    // --------------J1pin7    PA7		    雾灯     ------>   绿
    return(!GPIO_ReadInputDataBit(FOGLIGHT_IO_Group, FOGLIGHT_Group_NUM)); //PA7
    //		 接高  触发
}
u8  DoorLight_StatusGet(void)
{
    //  --------------J1pin6	   PA1		   车门灯    ------>灰
    return (!GPIO_ReadInputDataBit(DOORLIGHT_IO_Group, DOORLIGHT_Group_NUM));	// PA1
    //		 接高  触发
}


/*
     -----------------------------
    2.  控制输出
     -----------------------------
*/
void  Enable_Relay(void)
{
    // 断开继电器

    GPIO_SetBits(RELAY_IO_Group, RELAY_Group_NUM); // 断开
}
void  Disable_Relay(void)
{
    // 接通继电器

