nathanlnw/tw705_nx_gsm_v1.0/bsp/stm32f207VC_tw705/app_712/protocol_808/Device_808.c
    GPIO_ResetBits(RELAY_IO_Group, RELAY_Group_NUM); // 通
}


u8  Get_SensorStatus(void)
{
    // 查询传感器状态
    u8  Sensorstatus = 0;

    /*
       -------------------------------------------------------------
    			F4	行车记录仪 TW705   管脚定义
       -------------------------------------------------------------
       遵循  GB10956 (2012)  Page26  表A.12  规定
      -------------------------------------------------------------
      | Bit  |		Note	   |  必备|   MCUpin  |   PCB pin  |   Colour | ADC
      ------------------------------------------------------------
    	  D7	  刹车			 *			  PE11			   9				黄
    	  D6	  左转灯	 *			   PE10 		                10				红
    	  D5	  右转灯	 *			   PC2				8				 白
    	  D4	  远光灯	 *			   PC0				4				 黑白
    	  D3	  近光灯	 *			   PA6				5				 粉
    	  D2	  雾灯		       	add 		 PA7			  7 			               绿	   *
    	  D1	  车门			 add 		 PA1			  6 			               灰	   *
    	  D0	  预留
     */


    //  1.   D7      刹车           *            PE11             J1 pin9                黄
    if(BreakLight_StatusGet())  //PE11
    {
        //		接高  触发
        Sensorstatus |= 0x80;
        BD_EXT.FJ_IO_1 |= 0x80; //  bit7
        BD_EXT.Extent_IO_status |= 0x10;  // bit4 ---->刹车
    }
    else
    {
        //   常态
        Sensorstatus &= ~0x80;
        BD_EXT.FJ_IO_1 &= ~0x80; //  bit7
        BD_EXT.Extent_IO_status &= ~0x10; //bit4 ---->刹车
    }
    // 2.  D6      左转灯     *             PE10            J1 pin10              红
    if(LeftLight_StatusGet())	//	PE10
    {
        //	   接高  触发
        Sensorstatus |= 0x40;
        BD_EXT.FJ_IO_1 |= 0x40; //  bit6
        BD_EXT.Extent_IO_status |= 0x08;//bit3---->  左转灯
    }
    else
    {
        //   常态
        Sensorstatus &= ~0x40;
        BD_EXT.FJ_IO_1 &= ~0x40; //  bit6
        BD_EXT.Extent_IO_status &= ~0x08; //bit3---->  左转灯
    }
    //  3.  D5      右转灯     *             PC2             J1  pin8                白
    if(RightLight_StatusGet())	//PC2
    {
        //		 接高  触发
        Sensorstatus |= 0x20;
        BD_EXT.FJ_IO_1 |= 0x20; //bit5
        BD_EXT.Extent_IO_status |= 0x04;// bit2----> 右转灯
    }
    else
    {
        //	常态
        Sensorstatus &= ~0x20;
        BD_EXT.FJ_IO_1 &= ~0x20; //bit5
        BD_EXT.Extent_IO_status &= ~0x04;//bit2----> 右转灯
    }

    // 4.  D4      远光灯     *             PC0              J1 pin4                黑白
    if(FarLight_StatusGet())	// PC0
    {
        //		 接高  触发
        Sensorstatus |= 0x10;
        BD_EXT.Extent_IO_status |= 0x02; //bit 1  ----->  远光灯

    }
    else
    {
        //	常态
        Sensorstatus &= ~0x10;
        BD_EXT.Extent_IO_status &= ~0x02; //bit 1  ----->  远光灯

    }
    //5.   D3      近光灯     *             PC1              J1 pin5                粉
    if(NEARLight_StatusGet())  // PC1
    {
        //       接高  触发
        Sensorstatus |= 0x08;
        BD_EXT.FJ_IO_1 |= 0x10; //bit4
        BD_EXT.Extent_IO_status |= 0x01; //bit 0  ----->  近光灯
    }
    else
    {
        //	  常态
        Sensorstatus &= ~0x08;
        BD_EXT.FJ_IO_1 &= ~0x10; //bit4
        BD_EXT.Extent_IO_status &= ~0x01; //bit 0  ----->  近光灯

    }
    //  6.    D2      雾灯          add          PC3              7                绿      *
    if(FOGLight_StatusGet())  //PC3
    {
        //	   接高  触发
        Sensorstatus |= 0x04;
        BD_EXT.FJ_IO_1 |= 0x08; //bit3
        BD_EXT.Extent_IO_status |= 0x40;//  bit6 ----> 雾灯
    }
    else
    {
        //   常态
        Sensorstatus &= ~0x04;
        BD_EXT.FJ_IO_1 &= ~0x08; //bit3
        BD_EXT.Extent_IO_status &= ~0x40;//  bit6 ----> 雾灯
    }
    // 7.    D1      车门          add          PA1              6                灰      *
    if(DoorLight_StatusGet())  // PE3
    {
        //		 接高  触发
        Sensorstatus |= 0x02;
        BD_EXT.FJ_IO_2 |= 0x01; //bit2
    }
    else
    {
        //	常态
        Sensorstatus &= ~0x02;
        BD_EXT.FJ_IO_2 |= 0x01; //bit2
    }

    //    8.  Reserved


    return Sensorstatus;
}

void  IO_statusCheck(void)
{
    u16  Speed_working = 0;

    //  0 .  根据校验状态选择速度
    if(JT808Conf_struct.DF_K_adjustState)
        Speed_working = Speed_cacu;
    else
        Speed_working = Speed_gps;
    //=============================================================================
    Vehicle_sensor = Get_SensorStatus();
    //------------ 0.2s    速度状态 -----------------------
    Sensor_buf[save_sensorCounter].DOUBTspeed = Speed_working / 10; //   速度  单位是km/h 所以除以10
    Sensor_buf[save_sensorCounter++].DOUBTstatus = Vehicle_sensor; //   状态
    if(save_sensorCounter > 200)
    {
        save_sensorCounter = 0;
        sensor_writeOverFlag = 1;
    }
    //============================================================================

    //  事故疑点触发判断

    //  停车触发 事故疑点1
    if((Spd_Using < 70) && (Sps_larger_5_counter > 10) && (Speed_cacu_BAK > Spd_Using) && (Speed_cacu_Trigger_Flag == 0))
    {
        moni_drv(0x10, 0);
        Speed_cacu_Trigger_Flag = 1;
    }
    else if((Spd_Using > 60) && (Speed_cacu_BAK > 60) && (Sps_larger_5_counter > 10))
        Speed_cacu_Trigger_Flag = 0; // clear

    Speed_cacu_BAK = Spd_Using;
    //--------------------------------------------------


}

void  ACC_status_Check(void)
{
    //------------车辆运行状态指示 ---------------
    if(ACC_StatusGet())           //bit 0
    {
        Vehicle_RunStatus |= 0x01;
        //   ACC ON		 打火
        StatusReg_ACC_ON();  // ACC  状态寄存器
        Sleep_Mode_ConfigExit(); // 休眠相关
    }
    else
    {
        Vehicle_RunStatus &= ~0x01;
        //	  ACC OFF	   关火
        StatusReg_ACC_OFF();  // ACC  状态寄存器
        Sleep_Mode_ConfigEnter(); // 休眠相关
    }
}

/*
     -----------------------------
    2.  应用相关
     -----------------------------
*/
//-------------------------------------------------------------------------------------------------

/*采用PA.0 作为外部脉冲计数*/
void pulse_init( void )
{
    GPIO_InitTypeDef	GPIO_InitStructure;
    NVIC_InitTypeDef	NVIC_InitStructure;
    TIM_ICInitTypeDef	TIM_ICInitStructure;

    /* TIM5 clock enable */
    RCC_APB1PeriphClockCmd( RCC_APB1Periph_TIM5, ENABLE );

    /* GPIOA clock enable */
    RCC_AHB1PeriphClockCmd( RCC_AHB1Periph_GPIOA, ENABLE );

    /* TIM5 chennel1 configuration : PA.0 */
    GPIO_InitStructure.GPIO_Pin		= GPIO_Pin_0;
    GPIO_InitStructure.GPIO_Mode	= GPIO_Mode_AF;
    GPIO_InitStructure.GPIO_Speed	= GPIO_Speed_100MHz;
    GPIO_InitStructure.GPIO_OType	= GPIO_OType_PP;
    GPIO_InitStructure.GPIO_PuPd	= GPIO_PuPd_UP;
    GPIO_Init( GPIOA, &GPIO_InitStructure );

