nathanlnw/tw705_nx_gsm_v1.0/bsp/stm32f207VC_tw705/app_712/protocol_808/Device_808.c
    /* Connect TIM pin to AF0 */
    GPIO_PinAFConfig( GPIOA, GPIO_PinSource0, GPIO_AF_TIM5 );

    /* Enable the TIM5 global Interrupt */
    NVIC_InitStructure.NVIC_IRQChannel						= TIM5_IRQn;
    NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority	= 0;
    NVIC_InitStructure.NVIC_IRQChannelSubPriority			= 1;
    NVIC_InitStructure.NVIC_IRQChannelCmd					= ENABLE;
    NVIC_Init( &NVIC_InitStructure );

    TIM_ICInitStructure.TIM_Channel		= TIM_Channel_1;
    TIM_ICInitStructure.TIM_ICPolarity	= TIM_ICPolarity_Rising;
    TIM_ICInitStructure.TIM_ICSelection = TIM_ICSelection_DirectTI;
    TIM_ICInitStructure.TIM_ICPrescaler = TIM_ICPSC_DIV1;
    TIM_ICInitStructure.TIM_ICFilter	= 0x0;

    TIM_PWMIConfig( TIM5, &TIM_ICInitStructure );

    /* Select the TIM5 Input Trigger: TI1FP1 */
    TIM_SelectInputTrigger( TIM5, TIM_TS_TI1FP1 );

    /* Select the slave Mode: Reset Mode */
    TIM_SelectSlaveMode( TIM5, TIM_SlaveMode_Reset );
    TIM_SelectMasterSlaveMode( TIM5, TIM_MasterSlaveMode_Enable );

    /* TIM enable counter */
    TIM_Cmd( TIM5, ENABLE );

    /* Enable the CC2 Interrupt Request */
    TIM_ITConfig( TIM5, TIM_IT_CC2, ENABLE );
}

/*TIM5_CH1*/
void TIM5_IRQHandler( void )
{
    RCC_ClocksTypeDef RCC_Clocks;
    RCC_GetClocksFreq( &RCC_Clocks );

    TIM_ClearITPendingBit( TIM5, TIM_IT_CC2 );

    /* Get the Input Capture value */
    IC2Value = TIM_GetCapture2( TIM5 );

    if( IC2Value != 0 )
    {
        /*是不是反向电路?*/
        Delta_1s_Plus = ( RCC_Clocks.HCLK_Frequency ) / 2 / TIM_GetCapture1( TIM5 );
        //   交通部认证 相关取传感器速度
        if(Speed_jiade != 1) //(Speed_jiade==0)
            Speed_cacu = (Delta_1s_Plus * 36000) / JT808Conf_struct.Vech_Character_Value; // 计算的速度
        DutyCycle = 0;
    }
    else
    {
        Delta_1s_Plus	= 0;
    }
}

/*定时器配置*/
void TIM3_Config( void )
{
    NVIC_InitTypeDef		NVIC_InitStructure;
    TIM_TimeBaseInitTypeDef TIM_TimeBaseStructure;

    /* TIM3 clock enable */
    RCC_APB1PeriphClockCmd( RCC_APB1Periph_TIM3, ENABLE );

    /* Enable the TIM3 gloabal Interrupt */
    NVIC_InitStructure.NVIC_IRQChannel						= TIM3_IRQn;
    NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority	= 0;
    NVIC_InitStructure.NVIC_IRQChannelSubPriority			= 2;
    NVIC_InitStructure.NVIC_IRQChannelCmd					= ENABLE;
    NVIC_Init( &NVIC_InitStructure );

    /* Time base configuration */
    TIM_TimeBaseStructure.TIM_Period		= 100;             /* 0.1ms */
    TIM_TimeBaseStructure.TIM_Prescaler		= ( 120 / 2 - 1 );  /* 1M*/
    TIM_TimeBaseStructure.TIM_ClockDivision = TIM_CKD_DIV1;
    TIM_TimeBaseStructure.TIM_CounterMode	= TIM_CounterMode_Up;
    TIM_ARRPreloadConfig( TIM3, ENABLE );

    TIM_TimeBaseInit( TIM3, &TIM_TimeBaseStructure );

    TIM_ClearFlag( TIM3, TIM_FLAG_Update );
    /* TIM Interrupts enable */
    TIM_ITConfig( TIM3, TIM_IT_Update, ENABLE );

    /* TIM3 enable counter */
    TIM_Cmd( TIM3, ENABLE );
}


void TIM3_IRQHandler(void)
{

    if ( TIM_GetITStatus(TIM3 , TIM_IT_Update) != RESET )
    {
        TIM_ClearITPendingBit(TIM3 , TIM_FLAG_Update);

        //---------------------Timer  Counter --------------------------
        TIM3_Timer_Counter++;

        if(TIM3_Timer_Counter == 200)
        {
            //--------  service ------------------
            KeyCheckFun();
            //---------- IC card  insert --------------------------
            if((GSM_PWR.GSM_power_over) && (DF_initOver) && (Login_Menu_Flag)) // power ok than check ic
                CheckICInsert();
            //------- Buzzer -----------------------------------
            KeyBuzzer(IC_CardInsert);
            //-----------service -----------------
            TIM3_Timer_Counter = 0;
        }
        // --- 电压检测
        Voltage_Checking();
        //-------------One Counter  ---------------
        TIM3_OneSecondCounter++;
        //  0.2 s
        if((TIM3_OneSecondCounter % 2000) == 0)
        {
            //---------0.2s	---
            IO_statusCheck(); 		  // 0.2 s	一次
        }
        //   1 s
        if(TIM3_OneSecondCounter == 10000) // 1s  10000
        {

            if((GB19056.speedlog_Day_save_times == 0) && (UDP_dataPacket_flag == 0x02)) // 每天只存储一条
                GB_SpeedSatus_Judge();
            //-------------------------------------------
            VDR_product_08H_09H_10H();
            //-----   国标语音提示
            GB_Warn_Running();
            //-------------------------------------------
            TIM3_OneSecondCounter = 0;

            if(GB19056.Deltaplus_outEnble == 3)
                GB_out_E1_ACK();
            //if(GB19056.Deltaplus_outEnble==2)
            //output_spd(Speed_cacu);
        }
        // speed_clear
        if(Speed_jiade != 1) //(Speed_jiade==0)
        {
            DutyCycle++;
            if(DutyCycle > 2000)
            {
                DutyCycle = 0;
                Speed_cacu = 0; // clear
            }
        }
        else
            DutyCycle = 0;
        //------------ GB19056  related -------------
        if(GB19056.DB9_7pin)
        {
            GB19056.Plus_tick_counter++;
            if(GB19056.Deltaplus_outEnble == 2)
            {
                if(GB19056.Plus_tick_counter >= GB19056.DeltaPlus_out_Duration)
                {
                    GPIO_SetBits(GPIOB, GPIO_Pin_1);	  //输出常态 置 1
                    GB19056.Plus_tick_counter = 0;
                }
                else if(GB19056.Plus_tick_counter == 10)
                {
                    GPIO_ResetBits(GPIOB, GPIO_Pin_1);	  //输出常态 置 0
                }

            }
            else if(GB19056.Deltaplus_outEnble == 1)
            {
                if(GB19056.Plus_tick_counter >= 10000)
                {
                    GPIO_SetBits(GPIOB, GPIO_Pin_1);	  //输出常态 置 1
                    GB19056.Plus_tick_counter = 0;
                }
                else if(GB19056.Plus_tick_counter == 10)
                {
                    GPIO_ResetBits(GPIOB, GPIO_Pin_1);	  //输出常态 置 0
                }
            }
        }
        //---------------------------------------------------------------
    }
}

/*************************************************
Function:    void GPIO_Config(void)
Description: GPIO配置函数
Input: 无
Output:无
Return:无
*************************************************/
void GPIO_Config_PWM(void)
{
    /*定义了一个GPIO_InitStructure的结构体，方便一下使用 */
    GPIO_InitTypeDef GPIO_InitStructure;
    /* 使能GPIOG时钟（时钟结构参见“stm32图解.pdf”）*/
    RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOA , ENABLE);
    /*仅设置结构体中的部分成员：这种情况下，用户应当首先调用函数PPP_SturcInit(..)
    来初始化变量PPP_InitStructure，然后再修改其中需要修改的成员。这样可以保证其他
    成员的值（多为缺省值）被正确填入。
     */
    GPIO_StructInit(&GPIO_InitStructure);

    /*配置GPIOA_Pin_8，作为TIM1_Channel2 PWM输出*/
    //GPIO_InitStructure.GPIO_Pin = GPIO_Pin_1 | GPIO_Pin_5; //指定复用引脚
    GPIO_InitStructure.GPIO_Pin = GPIO_Pin_5; //指定复用引脚
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF;    //模式必须为复用！
    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;   //频率为快速
    GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_UP;          //上拉与否对PWM产生无影响
    GPIO_Init(GPIOA, &GPIO_InitStructure);

    //GPIO_PinAFConfig(GPIOA, GPIO_PinSource1, GPIO_AF_TIM2); //复用GPIOA_Pin1为TIM2_Ch2
    GPIO_PinAFConfig(GPIOA, GPIO_PinSource5, GPIO_AF_TIM2); //复用GPIOA_Pin5为TIM2_Ch1,
}

/*************************************************
Function:    void TIM_Config(void)
Description: 定时器配置函数
Input:       无
Output:      无
*************************************************/
void TIM_Config_PWM(void)
{
    TIM_TimeBaseInitTypeDef TIM_TimeBaseStructure;
    TIM_OCInitTypeDef TIM_OCInitStructure;
    RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM2, ENABLE);
    TIM_DeInit(TIM2);//初始化TIM2寄存器
    /*分频和周期计算公式：
      Prescaler = (TIMxCLK / TIMx counter clock) - 1;
      Period = (TIMx counter clock / TIM3 output clock) - 1
      TIMx counter clock为你所需要的TXM的定时器时钟
      */
    TIM_TimeBaseStructure.TIM_Period = 10 - 1; //查数据手册可知，TIM2与TIM5为32位自动装载，计数周期
    /*在system_stm32f4xx.c中设置的APB1 Prescaler = 4 ,可知
      APB1时钟为168M/4*2,因为如果APB1分频不为1，则定时时钟*2
     */
    TIM_TimeBaseStructure.TIM_Prescaler = 2100 - 1;
    TIM_TimeBaseStructure.TIM_ClockDivision = TIM_CKD_DIV1;
    TIM_TimeBaseStructure.TIM_CounterMode = TIM_CounterMode_Up;//向上计数
    TIM_TimeBaseInit(TIM2, &TIM_TimeBaseStructure);

    /*配置输出比较，产生占空比为20%的PWM方波*/
    TIM_OCStructInit(&TIM_OCInitStructure);
    TIM_OCInitStructure.TIM_OCMode = TIM_OCMode_PWM1;//PWM1为正常占空比模式，PWM2为反极性模式
    TIM_OCInitStructure.TIM_OutputState = TIM_OutputState_Enable;
    //TIM_OCInitStructure.TIM_Pulse = 2;//输入CCR（占空比数值）
    TIM_OCInitStructure.TIM_Pulse = 5;//输入CCR（占空比数值）
    TIM_OCInitStructure.TIM_OCPolarity = TIM_OCPolarity_High;//High为占空比高极性，此时占空比为20%；Low则为反极性，占空比为80%

    TIM_OC1Init(TIM2, &TIM_OCInitStructure);
    TIM_OC1PreloadConfig(TIM2, TIM_OCPreload_Enable);//CCR自动装载默认也是打开的

    TIM_ARRPreloadConfig(TIM2, ENABLE);  //ARR自动装载默认是打开的，可以不设置

    TIM_ClearFlag(TIM2, TIM_FLAG_Update);
    TIM_ITConfig(TIM2, TIM_IT_Update, ENABLE);
    TIM_Cmd(TIM2, ENABLE); //使能TIM2定时器
}


//---------------------------------------------------------------------------------------------------
void Init_ADC(void)
{

    ADC_InitTypeDef   ADC_InitStructure;
    GPIO_InitTypeDef		gpio_init;
    ADC_CommonInitTypeDef  ADC_CommonInitStructure;
    DMA_InitTypeDef DMA_InitStructure;


