nathanlnw/tw705_nx_gsm_v1.0/bsp/stm32f207VC_tw705/app_712/protocol_808/Device_808.c
    //  1.  Clock
    RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_DMA2 | RCC_AHB1Periph_GPIOA | RCC_AHB1Periph_GPIOC, ENABLE);
    RCC_APB2PeriphClockCmd(RCC_APB2Periph_ADC1, ENABLE);

    //  2.  GPIO  Config
    //------Configure PC.5 (ADC Channel15) as analog input -------------------------
    gpio_init.GPIO_Pin = GPIO_Pin_5;
    gpio_init.GPIO_Mode = GPIO_Mode_AIN;
    GPIO_Init(GPIOC, &gpio_init);


#ifdef BD_IO_Pin6_7_A1C3
    //------Configure PA.1 (ADC Channel1) as analog input -------------------------
    gpio_init.GPIO_Pin = GPIO_Pin_1;
    gpio_init.GPIO_Mode = GPIO_Mode_AIN;
    GPIO_Init(GPIOA, &gpio_init);

    //------Configure PC.3 (ADC Channel13) as analog input -------------------------
    gpio_init.GPIO_Pin = GPIO_Pin_3;
    gpio_init.GPIO_Mode = GPIO_Mode_AIN;
    GPIO_Init(GPIOC, &gpio_init);
#endif


    //  3. ADC Common Init
    /* ADC Common configuration *************************************************/
    ADC_CommonInitStructure.ADC_Mode = ADC_Mode_Independent; /*在独立模式下 每个ADC接口独立工作*/
    ADC_CommonInitStructure.ADC_Prescaler = ADC_Prescaler_Div2;
    ADC_CommonInitStructure.ADC_DMAAccessMode = ADC_DMAAccessMode_1;// ADC_DMAAccessMode_Disabled;
    ADC_CommonInitStructure.ADC_TwoSamplingDelay = ADC_TwoSamplingDelay_5Cycles;
    ADC_CommonInit(&ADC_CommonInitStructure);


    ADC_InitStructure.ADC_Resolution = ADC_Resolution_12b;
    ADC_InitStructure.ADC_ScanConvMode = ENABLE;  // if used  multi channels set enable
    ADC_InitStructure.ADC_ContinuousConvMode = ENABLE;
    ADC_InitStructure.ADC_ExternalTrigConvEdge = ADC_ExternalTrigConvEdge_None;
    ADC_InitStructure.ADC_ExternalTrigConv = ADC_ExternalTrigConv_T1_CC1;
    ADC_InitStructure.ADC_DataAlign = ADC_DataAlign_Right;
    ADC_InitStructure.ADC_NbrOfConversion = 3;    // number of   channel
    ADC_Init(ADC1, &ADC_InitStructure);


    //  4. DMA  Config
    /* DMA2 Stream0 channel0 configuration */
    DMA_InitStructure.DMA_Channel = DMA_Channel_0;
    DMA_InitStructure.DMA_PeripheralBaseAddr = (uint32_t)ADC1_DR_Address;
    DMA_InitStructure.DMA_Memory0BaseAddr = (uint32_t)ADC_ConValue;
    DMA_InitStructure.DMA_DIR = DMA_DIR_PeripheralToMemory;
    DMA_InitStructure.DMA_BufferSize = 3;
    DMA_InitStructure.DMA_PeripheralInc = DMA_PeripheralInc_Disable;
    DMA_InitStructure.DMA_MemoryInc = DMA_MemoryInc_Enable;
    DMA_InitStructure.DMA_PeripheralDataSize = DMA_PeripheralDataSize_HalfWord;
    DMA_InitStructure.DMA_MemoryDataSize = DMA_MemoryDataSize_HalfWord;
    DMA_InitStructure.DMA_Mode = DMA_Mode_Circular;
    DMA_InitStructure.DMA_Priority = DMA_Priority_High;
    DMA_InitStructure.DMA_FIFOMode = DMA_FIFOMode_Disable;
    DMA_InitStructure.DMA_FIFOThreshold = DMA_FIFOThreshold_HalfFull;
    DMA_InitStructure.DMA_MemoryBurst = DMA_MemoryBurst_Single;
    DMA_InitStructure.DMA_PeripheralBurst = DMA_PeripheralBurst_Single;
    DMA_Init(DMA2_Stream0, &DMA_InitStructure);

    /* DMA2_Stream0 enable */
    DMA_Cmd(DMA2_Stream0, ENABLE);


    /* ADC1 regular channel15 configuration *************************************/
    ADC_RegularChannelConfig(ADC1, ADC_Channel_15, 1, ADC_SampleTime_3Cycles);  // 通道1  电池电量
    /* ADC1 regular channel1 configuration *************************************/
    ADC_RegularChannelConfig(ADC1, ADC_Channel_1, 2, ADC_SampleTime_3Cycles);   //  通道2   灰线
    /* ADC1 regular channel13 configuration *************************************/
    ADC_RegularChannelConfig(ADC1, ADC_Channel_13, 3, ADC_SampleTime_3Cycles);  // 通道3   绿线

    /* Enable DMA request after last transfer (Single-ADC mode) */
    ADC_DMARequestAfterLastTransferCmd(ADC1, ENABLE);

    /* Enable ADC1 DMA */
    ADC_DMACmd(ADC1, ENABLE);

    /* Enable ADC3 */
    ADC_Cmd(ADC1, ENABLE);

    ADC_SoftwareStartConv(ADC1);

    //====================================

}



//==========================================================
#if 0
void  sys_status(void)
{
    rt_kprintf("\r\n 状态查询: ");
    //-----  报警  ---
    if(WARN_StatusGet())
        rt_kprintf(" 紧急报警      ");
    //     ACC
    if(ACC_StatusGet())
        rt_kprintf("ACC 开    ");
    else
        rt_kprintf("ACC 关    ");
    //     AD 电压
    rt_kprintf ("\r\n  获取到的电池AD数值为:	%d	", Power_AD.ADC_ConvertedValue);
    rt_kprintf(" AD 电压: %d.%d  V  ", Power_AD.AD_Volte / 10, Power_AD.AD_Volte % 10);
    //    信号线
    rt_kprintf("    %s      ", XinhaoStatus);
    if( Powercut_Status == 0x02)
        rt_kprintf("      电源状态 :   电池供电");
    else if( Powercut_Status == 0x01)
        rt_kprintf("      电源状态 :  外电源供电");
    //   定位模式
    rt_kprintf("\r\n 定位模式:    ");
    switch(GpsStatus.Position_Moule_Status)
    {
    case 1:
        rt_kprintf(" BD");
        break;
    case 2:
        rt_kprintf(" GPS ");
        break;
    case 3:
        rt_kprintf(" BD+GPS");
        break;
    }
    //   定位状状态
    if(ModuleStatus & Status_GPS)
        rt_kprintf("         定位状态:  定位   卫星颗数: %d 颗 ", Satelite_num);
    else
        rt_kprintf("         定位状态: 未定位");
    //    GPS 天线状态
    if(GpsStatus.Antenna_Flag == 1)
        rt_kprintf("        天线:     断开");
    else
        rt_kprintf("        天线:     正常");
    //   GPRS  状态
    if(ModuleStatus & Status_GPRS)
        rt_kprintf("      GPRS 状态:   Online\r\n");
    else
        rt_kprintf("      GPRS 状态:   Offline\r\n");

    rt_kprintf("\r\n 电源 ADV1=%d ,模拟量1(8pin   黄线线)ADV2=%d, 模拟量2( 10pin 橙线 PC3 )ADV3=%d \r\n", ADC_ConValue[0], ADC_ConValue[1], ADC_ConValue[2]);
    rt_kprintf("\r\nAD1  Voltage=%d.%d V,   Voltage=%d.%d V   \r\n", AD_2through[0] / 10, AD_2through[0] % 10, AD_2through[1] / 10, AD_2through[1] % 10);

}
//FINSH_FUNCTION_EXPORT(sys_status, Status);
#endif


void dispdata(char *instr)
{
    if (strlen((const char *)instr) == 0)
    {
        DispContent = 1;
        return ;
    }
    else
    {
        DispContent = (instr[0] - 0x30);
        rt_kprintf("\r\n		Dispdata =%d \r\n", DispContent);
		/*
		if(DispContent==1)
		   speed_Exd.PlayState=1;
		else
			{
                speed_Exd.PlayState=0; 
		         speed_Exd.PlayCounter=0;
 
