nathanlnw/tw705_nx_gsm_v1.0/bsp/stm32f207VC_tw705/app_712/protocol_808/Device_808.c
			}
		*/
        return;
    }
}
FINSH_FUNCTION_EXPORT(dispdata, Debug disp set) ;


int str2ipport(char *buf, u8 *ip, u16 *port)
{
    // convert an ip:port string into a binary values
    int	i;
    u16	_ip[4], _port;


    _port = 0;
    memset(_ip, 0, sizeof(_ip));

    strtrim((u8 *)buf, ' ');

    i = sscanf(buf, "%u.%u.%u.%u:%u", (u32 *)&_ip[0], (u32 *)&_ip[1], (u32 *)&_ip[2], (u32 *)&_ip[3], (u32 *)&_port);

    *(u8 *)(ip + 0) = (u8)_ip[0];
    *(u8 *)(ip + 1) = (u8)_ip[1];
    *(u8 *)(ip + 2) = (u8)_ip[2];
    *(u8 *)(ip + 3) = (u8)_ip[3];
    *port = _port;

    return i;
}

void Socket_main_Set(u8 *str)
{
    u8 i = 0;
    u8 reg_str[80];

    if (strlen((const char *)str) == 0)
    {
        rt_kprintf("\r\n input error\r\n");
        return ;
    }
    else
    {
        i = str2ipport((char *)str, RemoteIP_main, &RemotePort_main);
        if (i <= 4) return ;;

        memset(reg_str, 0, sizeof(reg_str));
        IP_Str((char *)reg_str, *( u32 * ) RemoteIP_main);
        strcat((char *)reg_str, " :");
        sprintf((char *)reg_str + strlen((const char *)reg_str), "%u\r\n", RemotePort_main);
        memcpy((char *)SysConf_struct.IP_Main, RemoteIP_main, 4);
        SysConf_struct.Port_main = RemotePort_main;
        Api_Config_write(config, ID_CONF_SYS, (u8 *)&SysConf_struct, sizeof(SysConf_struct)); 

        DataLink_MainSocket_set(RemoteIP_main, RemotePort_main, 1);
        DataLink_EndFlag = 1; //AT_End();
        return ;
    }

}
FINSH_FUNCTION_EXPORT(Socket_main_Set, Set Socket main);

void  debug_relay(u8 *str)
{
    if (strlen((const char *)str) == 0)
    {
        ; //rt_kprintf("\r\n继电器(1:断开0:闭合)JT808Conf_struct.relay_flag=%d",JT808Conf_struct.relay_flag);
    }
    else
    {
        if(str[0] == '1')
        {
            Car_Status[2] |= 0x08;   // 需要控制继电器
            JT808Conf_struct.relay_flag = 1;
            Enable_Relay();
            //rt_kprintf("\r\n  断开继电器,JT808Conf_struct.relay_flag=%d\r\n",JT808Conf_struct.relay_flag);
        }
        else if(str[0] == '0')
        {
            Car_Status[2] &= ~0x08;  // 需要控制继电器
            JT808Conf_struct.relay_flag = 0;
            Disable_Relay();
            //rt_kprintf("\r\n  接通继电器,JT808Conf_struct.relay_flag=%d\r\n",JT808Conf_struct.relay_flag);
        }
    }
    Api_Config_Recwrite_Large(jt808, 0, (u8 *)&JT808Conf_struct, sizeof(JT808Conf_struct));
}
//FINSH_FUNCTION_EXPORT(debug_relay, Debug relay set) ;

void q7_relay(u8 value)
{
    Q7_enable = value;
    //rt_kprintf("\r\n Q7_relay: %d\r\n",Q7_enable);
}
//FINSH_FUNCTION_EXPORT(q7_relay, 0|1) ;


//==========================================================

/*
     -----------------------------
    3.  RT 驱动相关
     -----------------------------
*/



/*

       新驱动应用

*/



//  1 .  循环存储
u8       Api_cycle_write(u8 *buffer, u16 len)
{
    WatchDog_Feed();
    DF_TAKE;
    if( SaveCycleGPS(cycle_write, buffer, len))
    {
        //---- updata pointer   -------------
        cycle_write++;
        if(cycle_write >= Max_CycleNum)
            cycle_write = 0;
        DF_Write_RecordAdd(cycle_write, cycle_read, TYPE_CycleAdd);
        DF_delay_us(20);
        //-------------------------------
        DF_RELEASE;
        return true;
    }
    else
    {
        //-------------------------------
        DF_RELEASE;
        return  false;
    }
}

u8      Api_cycle_read(u8 *buffer, u16 len)
{
    return( ReadCycleGPS(cycle_read, buffer, len));
}
u8     Api_cycle_Update(void)
{
    if( ReadCycle_status == RdCycle_SdOver)	 // 发送成功判断
    {
        // process   0704
        if(delta_0704_rd == 0)
            cycle_read++;	 //  收到应答才递增
        if(cycle_read >= Max_CycleNum)
            cycle_read = 0;
        ReadCycle_status = RdCycle_Idle;
    }
    return 1;
}
u8   Api_CHK_ReadCycle_status(void)
{
    if(RdCycle_Idle == ReadCycle_status)
    {

        if(cycle_write != cycle_read)
        {
            ReadCycle_status = RdCycle_RdytoSD;
        }
        else
            ReadCycle_status = RdCycle_Idle;

    }
    return true;
}

// 2. Config
#ifdef AVRG15MIN

//   new  come  -------------------
u8  Api_15min_read_1_record(u32 indexNum, u8 *dest)
{
    u8  fcs_in = 0, i = 0, counter = 0;
    u8  regist_str[8];
    u32  addr = (Avrg15minSpeedt_offset << 9); // 起始地址


    SST25V_BufferRead(regist_str, addr + 8 * indexNum, 8);
    fcs_in = 0;
    for(i = 0; i < 7; i++)
    {
        fcs_in ^= regist_str[i];
    }

    if(regist_str[7] != fcs_in)
    {
        // OutPrint_HEX("read s",regist_str,8);
        //printf("\r\n 读取1 record: 校验错误\r\n");
        return 0;
    }
    else
    {
        counter = 0;
        for(i = 0; i < 7; i++)
        {
            if(0xFF == regist_str[i])
                counter++;
            else
                break;
        }
        if(counter == 7)
        {
            rt_kprintf("\r\n counter=%d,全FF\r\n", counter);
            return 0;
        }
        // OutPrint_HEX("校验正确", regist_str,8);
        memcpy(dest, regist_str, 7);
    }

    // OutPrint_HEX("record",regist_str,7);
    return 7;
}


u8  Api_avrg15minSpd_Content_read(u8 *dest)
{
    u8	fcs_in = 0, i = 0, limit = 0; //rx_timer=15;
    u8	reg[8];
    u8	regist_str[128];
    u32  read_index = 0;
    u32  addr = (Avrg15minSpeedt_offset << 9); // 起始地址


    memset(regist_str, 0, sizeof(regist_str));	 //  clear
    if((Avrg_15minSpd.write == 0) && (Avrg_15minSpd.read == 0))
    {
        // rt_kprintf("\r\n 无15分钟最新记录1\r\n");
        return 0;
    }

    if((Avrg_15minSpd.read == 1) && (Avrg_15minSpd.write < 15))
    {

        if(Avrg_15minSpd.write == 0)
            read_index = MAX_PERmin_NUM - 1;
        else
            read_index = Avrg_15minSpd.write - 1;


        DF_TAKE;
        for(i = 0; i < 15; i++)
        {
            if(Api_15min_read_1_record(read_index, reg) == 7)
                memcpy(regist_str + i * 7, reg, 7);
            // else
            // return 0;
            //-------------------------------
            if(read_index == 0)
                read_index = MAX_PERmin_NUM - 1;

            read_index--;
        }
        DF_RELEASE;
    }
    else
    {
        read_index = Avrg_15minSpd.write - 1;

