nathanlnw/tw705_nx_gsm_v1.0/bsp/stm32f207VC_tw705/app_712/protocol_808/Device_808.c
        if((Avrg_15minSpd.read == 0) && (Avrg_15minSpd.write < 15))
            limit = Avrg_15minSpd.write;
        else if((Avrg_15minSpd.write >= 15))
            limit = 15;

        DF_TAKE;
        for(i = 0; i < limit; i++)
        {
            if(Api_15min_read_1_record(read_index, reg) == 7)
                memcpy(regist_str + i * 7, reg, 7)	 ;
            //else
            // return 0;
            read_index--;
        }
        DF_RELEASE;
    }
    memcpy(dest, regist_str, 105);
    //OutPrint_HEX("读取15分钟平均速度记录",dest,105);

    return 105;
}
u8  Api_15min_save_1_record(void)
{
    u8 read_index_num = 0; // 读取flash的下标
    u8 avrg_spd = 0, value = 0;
    u8 reg[8];
    u32	addr = (Avrg15minSpeedt_offset << 9); // 起始地址


    //rt_kprintf("\r\n spd_accumlate=%d",Avrg_15minSpd.spd_accumlate);
    DF_TAKE;
    if(Avrg_15minSpd.seconds_counter)
    {
        avrg_spd = (Avrg_15minSpd.spd_accumlate / Avrg_15minSpd.seconds_counter); // 当前平均速度为0
    }
    else
        avrg_spd = 0;	// 存储为0	  平均速度为0

    //rt_kprintf("\r\n avrg_spd=%d",avrg_spd);
    // 准备存储	  0. 查看有没有以前的记录
    if((Avrg_15minSpd.write > 0) || (Avrg_15minSpd.read == 1))
    {
        // 读取前一条记录，做时间比对   read 为1 表示存储超过一个大循环，否则为0
        if((Avrg_15minSpd.read) && (Avrg_15minSpd.write == 0))
        {
            read_index_num = MAX_PERmin_NUM - 1;
        }
        else
            read_index_num = Avrg_15minSpd.write - 1;

        memset(reg, 0, sizeof(reg));
        if(7 == Api_15min_read_1_record(read_index_num, reg))
        {
            // 当前时间和最后一次存储时间是否一致，否则不存储。
            Avrg15_min_generate(avrg_spd);
            if((Avrg_15minSpd.content[0] == reg[0]) && (Avrg_15minSpd.content[1] == reg[1]) &&
                    (Avrg_15minSpd.content[2] == reg[2]) && (Avrg_15minSpd.content[3] == reg[3]) &&
                    (Avrg_15minSpd.content[4] == reg[4]) && (Avrg_15minSpd.content[5] == reg[5]) &&
                    (Avrg_15minSpd.content[6] == reg[6]))
            {
                DF_RELEASE;
                return 0;
            }
        }

    }

    //  save

    //  2.  Check	wehter	need  to earase  sector
    if(Avrg_15minSpd.write >= MAX_PERmin_NUM)
    {
        Avrg_15minSpd.write = 0;
        Avrg_15minSpd.read = 1; // 表示存储过一个大循环
    }
    if(Avrg_15minSpd.write % 512 == 0) // 64  record ==512 bytes 	 4K=  8*64 =512
        SST25V_SectorErase_4KByte(addr + Avrg_15minSpd.write * 8);
    //  3. save
    // save content
    SST25V_BufferWrite( Avrg_15minSpd.content, addr + Avrg_15minSpd.write * 8, 8);
    Avrg_15minSpd.write++;
    // save wr pos
    DF_Write_RecordAdd(Avrg_15minSpd.write, Avrg_15minSpd.read, TYPE_15minSpd);
    // OutPrint_HEX("写1min spd",Avrg_15minSpd.content,8);
    DF_RELEASE;
    return 1;
}

u8	Avrg15_min_generate(u8 spd)
{
    u8  fcs_in = 0, i = 0;

    Avrg_15minSpd.content[0] = time_now.year;
    Avrg_15minSpd.content[1] = time_now.month;
    Avrg_15minSpd.content[2] = time_now.day;
    Avrg_15minSpd.content[3] = time_now.hour;
    Avrg_15minSpd.content[4] = time_now.min;
    Avrg_15minSpd.content[5] = 0;
    Avrg_15minSpd.content[6] = spd;

    fcs_in = 0;
    for(i = 0; i < 7; i++)
    {
        fcs_in ^= Avrg_15minSpd.content[i];
    }
    Avrg_15minSpd.content[7] = fcs_in;

    return true;
}


void Averg15_min_timer_1s(void)
{
    u8 spd_reg = 0, i = 0, spd_usefull_counter = 0, pos_V = 0, avrg_spd = 0;
    u8 reg8[6];


    //  停车前15 分钟平均速度记录
    if(Avrg_15minSpd.seconds_counter == 59)
    {
        Api_15min_save_1_record();
    }
    //---------09  tick --------------
    Avrg_15minSpd.seconds_counter++;
    if(Avrg_15minSpd.seconds_counter >= 60)
    {
        Avrg_15minSpd.seconds_counter = 0;
        Avrg_15minSpd.spd_accumlate = 0;
    }
    //  upadate  per second	 it's  very  important
    Avrg_15minSpd.spd_accumlate += Spd_Using / 10;
}

#endif


u8    Api_Config_write(u8 *name, u16 ID, u8 *buffer, u16 wr_len)
{
    DF_TAKE;
    if(strcmp((const char *)name, config) == 0)
    {
        DF_WriteFlashSector(ConfigStart_offset, 0, buffer, wr_len);
        DF_delay_ms(10);
        DF_WriteFlashSector(ConfigStart_BakSetting_offset, 0, buffer, wr_len); // bak  setting
        DF_delay_ms(10); 
        DF_WriteFlashSector(ConfigStart_Bak2Setting_offset, 0, buffer, wr_len); // bak  setting
        DF_RELEASE;
        return true;
    }
    if(strcmp((const char *)name, tired_config) == 0)
    {
        DF_WriteFlashSector(TiredCondifg_offset, 0, buffer, wr_len);
        DF_RELEASE;
        return true;
    }
    DF_RELEASE;
    return false;
}
u8      Api_Config_read(u8 *name, u16 ID, u8 *buffer, u16 Rd_len)  //  读取Media area ID 是报数
{
    if(strcmp((const char *)name, config) == 0)
    {
        DF_ReadFlash(ConfigStart_offset, 0, buffer, Rd_len);
        DF_delay_ms(80); 	// large content delay
        return true;
    }
    if(strcmp((const char *)name, jt808) == 0)
    {
        WatchDog_Feed();
        DF_ReadFlash(JT808Start_offset, 0, buffer, Rd_len);
        DF_delay_ms(100); // large content delay
        return true;
    }
    if(strcmp((const char *)name, tired_config) == 0)
    {
        DF_ReadFlash(TiredCondifg_offset, 0, buffer, Rd_len);
        DF_delay_ms(10);
        return true;
    }
    if(strcmp((const char *)name, BD_ext_config) == 0)
    {
        DF_ReadFlash(DF_BD_Extend_Page, 0, buffer, Rd_len);
        DF_delay_ms(10);
        return true;
    }
    return false;

}

u8    Api_Config_Recwrite_Large(u8 *name, u16 ID, u8 *buffer, u16 wr_len) // 更新最新记录
{
    DF_TAKE;
    if(strcmp((const char *)name, jt808) == 0)
    {
        WatchDog_Feed();
        DF_WriteFlashSector(JT808Start_offset, 0, buffer, wr_len);  // formal  use
        WatchDog_Feed();
        DF_WriteFlashSector(JT808_BakSetting_offset, 0, buffer, wr_len); // bak  setting
        WatchDog_Feed();
        DF_WriteFlashSector(JT808_Bak2Setting_offset, 0, buffer, wr_len); // bak  setting
        DF_RELEASE;
        return true;
    }
    if(strcmp((const char *)name, BD_ext_config) == 0)
    {
        DF_WriteFlashSector(DF_BD_Extend_Page, 0, buffer, wr_len);
        DF_RELEASE;
        return true;
    }
    DF_RELEASE;
    return false;
}

//  3.  其他

