nathanlnw/tw705_nx_gsm_v1.0/bsp/stm32f207VC_tw705/app_712/protocol_808/Device_808.c
void   Api_MediaIndex_Init(void)
{

    u8 i = 0;

    memset((u8 *)&MediaIndex, 0, sizeof(MediaIndex));

    for(i = 0; i < 8; i++)
    {
        MediaIndex.ID = i + 1;
        if(i == 0)
        {
            MediaIndex.Type = 0;
            memset(MediaIndex.FileName, 0, sizeof(MediaIndex.FileName));
            memcpy(MediaIndex.FileName, "pic.jpg", 7);
            DF_WriteFlashSector(DF_PicIndex_Page, 0, (u8 *)&MediaIndex, sizeof(MediaIndex));
            DF_delay_ms(50);
            MediaIndex.Type = 1;
            memset(MediaIndex.FileName, 0, sizeof(MediaIndex.FileName));
            memcpy(MediaIndex.FileName, "sound.wav", 9);
            DF_WriteFlashSector(DF_SoundIndex_Page, 0, (u8 *)&MediaIndex, sizeof(MediaIndex));
            DF_delay_ms(50);
        }
        else
        {
            MediaIndex.Type = 0;
            memset(MediaIndex.FileName, 0, sizeof(MediaIndex.FileName));
            memcpy(MediaIndex.FileName, "pic.jpg", 7);
            DF_WriteFlashDirect(DF_PicIndex_Page + i, 0, (u8 *)&MediaIndex, sizeof(MediaIndex));
            DF_delay_ms(10);
            MediaIndex.Type = 1;
            memset(MediaIndex.FileName, 0, sizeof(MediaIndex.FileName));
            memcpy(MediaIndex.FileName, "sound.wav", 9);
            DF_WriteFlashDirect(DF_SoundIndex_Page + i, 0, (u8 *)&MediaIndex, sizeof(MediaIndex));
            DF_delay_ms(10);
        }
    }
}

u32  Api_DFdirectory_Query(u8 *name, u8  returnType)
{
    //  returnType=0  返回记录数目     returnType=1 时返回改目录文件大小
    u8   flag = 0;
    u32  pic_current_page = 0;

    if(strcmp((const char *)name, camera_1) == 0)
    {
        pic_current_page = PicStart_offset;
        flag = 1;
    }
    if(strcmp((const char *)name, camera_2) == 0)
    {
        pic_current_page = PicStart_offset2;
        flag = 1;
    }
    if(strcmp((const char *)name, camera_3) == 0)
    {
        pic_current_page = PicStart_offset3;
        flag = 1;
    }
    if(strcmp((const char *)name, camera_4) == 0)
    {
        pic_current_page = PicStart_offset4;
        flag = 1;
    }
    if(strcmp((const char *)name, voice) == 0)
    {
        DF_ReadFlash(SoundStart_offdet, 0, (u8 *)&SrcFileSize, 4);
        return SrcFileSize;
    }
    if(flag)
    {
        DF_delay_ms(5);
        DF_ReadFlash(pic_current_page, 0, PictureName, 23);
        memcpy((u8 *)&PicFileSize, PictureName + 19, 4);
        return   PicFileSize	;
    }
    return  0;
}

u8 Api_DFdirectory_Write(u8 *name, u8 *buffer, u16 len)
{
#ifdef SPD_WARN_SAVE
    if(strcmp((const char *)name, spd_warn) == 0)
    {

        Common_WriteContent( ExpSpdRec_write, buffer, len, TYPE_ExpSpdAdd);
        //-----  Record update----
        ExpSpdRec_write++;
        if(ExpSpdRec_write >= Max_exceed_Num)
            ExpSpdRec_write = 0;
        DF_Write_RecordAdd(ExpSpdRec_write, ExpSpdRec_write, TYPE_ExpSpdAdd);
        //-----  Record update----
        return true;
    }
#endif
    //------- MultiMedia   RAW  data  ---------
    if(strcmp((const char *)name, camera_1) == 0)
    {
        DF_WriteFlashDirect(pic_current_page, 0, buffer, len);
        return true;
    }
    if(strcmp((const char *)name, camera_2) == 0)
    {
        DF_WriteFlashDirect(pic_current_page, 0, buffer, len);
        return true;
    }
    if(strcmp((const char *)name, camera_3) == 0)
    {
        DF_WriteFlashDirect(pic_current_page, 0, buffer, len);
        return true;
    }
    if(strcmp((const char *)name, camera_4) == 0)
    {
        DF_WriteFlashDirect(pic_current_page, 0, buffer, len);
        return true;
    }

    return false;
}
u8  Api_DFdirectory_Read(u8 *name, u8 *buffer, u16 len, u8  style , u16 numPacket) // style  1. old-->new   0 : new-->old
{
    /*  连续调用几次 ，依次按style 方式递增*/
    // style  1. old-->new   0 : new-->old
    //   numPacket    : 安装 style  方式读取开始 第几条数据包  from: 0
    u16   read_addr = 0;

    DF_delay_ms(1);

#ifdef SPD_WARN_SAVE
    if(strcmp((const char *)name, spd_warn) == 0)
    {
        if(style == 1)
            read_addr = 0 + numPacket;
        else
        {
            if(ExpSpdRec_write == 0)
                return   false;
            else if(ExpSpdRec_write >= (numPacket + 1))
                read_addr = ExpSpdRec_write - 1 - numPacket;
            else
                return false;
        }
        Common_ReadContent( read_addr, buffer, len, TYPE_ExpSpdAdd);
        return true;
    }
#endif

    //------- MultiMedia   RAW  data  ---------
    if(strcmp((const char *)name, voice) == 0)
    {
        if(style == 0)
            return  false;  //  只允许从old  -> new
        DF_ReadFlash(SoundStart_offdet + numPacket, 0, buffer, len);
        return true;
    }
    if(strcmp((const char *)name, camera_1) == 0)
    {
        DF_ReadFlash(PicStart_offset + numPacket, 0, buffer, len);
        return true;
    }
    if(strcmp((const char *)name, camera_2) == 0)
    {
        DF_ReadFlash(PicStart_offset2 + numPacket, 0, buffer, len);
        return true;
    }
    if(strcmp((const char *)name, camera_3) == 0)
    {
        DF_ReadFlash(PicStart_offset3 + numPacket, 0, buffer, len);
        return true;
    }
    if(strcmp((const char *)name, camera_4) == 0)
    {
        DF_ReadFlash(PicStart_offset4 + numPacket, 0, buffer, len);
        return true;
    }

    return false;
}

u8    Api_DFdirectory_Delete(u8 *name)
{

    if(strcmp((const char *)name, voice) == 0)
    {
        WatchDog_Feed();
        SST25V_BlockErase_32KByte((SoundStart_offdet << 9));
        DF_delay_ms(300);
        WatchDog_Feed();
        return true;
    }
    if(strcmp((const char *)name, camera_1) == 0)
    {
        WatchDog_Feed();
        SST25V_BlockErase_64KByte((PicStart_offset << 9));
        DF_delay_ms(100);
        WatchDog_Feed();
        return true;
    }
    if(strcmp((const char *)name, camera_2) == 0)
    {
        WatchDog_Feed();
        SST25V_BlockErase_64KByte((PicStart_offset2 << 9));
        DF_delay_ms(100);
        WatchDog_Feed();
        return true;
    }
    if(strcmp((const char *)name, camera_3) == 0)
    {
        WatchDog_Feed();
        SST25V_BlockErase_64KByte((PicStart_offset3 << 9));
        DF_delay_ms(100);
        WatchDog_Feed();
        return true;
    }
    if(strcmp((const char *)name, camera_4) == 0)
    {
        WatchDog_Feed();
        SST25V_BlockErase_64KByte((PicStart_offset4 << 9));
        DF_delay_ms(100);
        WatchDog_Feed();
        return true;
    }
    return false;
}

//-------  固定位置 序号记录  -----------
u8   Api_RecordNum_Write( u8 *name, u8 Rec_Num, u8 *buffer, u16 len)  //  Rec_Num<128  Len<128
{
    WatchDog_Feed();
    if(strcmp((const char *)name, event_808) == 0)
    {
        DF_WriteFlash(DF_Event_Page + Rec_Num, 0, buffer, len);
        return true;
    }
    if(strcmp((const char *)name, msg_broadcast) == 0)
    {
        DF_WriteFlash(DF_Broadcast_offset + Rec_Num, 0, buffer, len);
        return true;
    }
    if(strcmp((const char *)name, phonebook) == 0)
    {
        DF_WriteFlash(DF_PhoneBook_Page + Rec_Num, 0, buffer, len);
        return true;
    }
    if(strcmp((const char *)name, Rail_cycle) == 0)
    {
        DF_WriteFlash(DF_Event_Page + Rec_Num, 0, buffer, len);
        return true;
    }
    if(strcmp((const char *)name, Rail_rect) == 0)
    {
        DF_WriteFlash(DF_RectangleRail_Page + Rec_Num, 0, buffer, len);
        return true;
    }
    if(strcmp((const char *)name, Rail_polygen) == 0)
    {
        DF_WriteFlash(DF_PolygenRail_Page + Rec_Num, 0, buffer, len);
        return true;
    }
    if(strcmp((const char *)name, turn_point) == 0)
    {
        DF_WriteFlash(DF_turnPoint_Page + Rec_Num, 0, buffer, len);
        return true;
    }
    if(strcmp((const char *)name, route_line) == 0)
    {
        DF_WriteFlash(DF_Route_Page + Rec_Num, 0, buffer, len);
        return true;
    }
    if(strcmp((const char *)name, ask_quesstion) == 0)
    {
        DF_WriteFlash(DF_AskQuestion_Page + Rec_Num, 0, buffer, len);
        return true;
    }
    if(strcmp((const char *)name, text_msg) == 0)
    {
        DF_WriteFlash(DF_Msg_Page + Rec_Num, 0, buffer, len);
        return true;
    }
    //-------------------------------
    if(strcmp((const char *)name, pic_index) == 0)
    {
        DF_WriteFlash(DF_PicIndex_Page + Rec_Num, 0, buffer, len);
        return true;
    }
    if(strcmp((const char *)name, voice_index) == 0)
    {
        DF_WriteFlash(DF_SoundIndex_Page + Rec_Num, 0, buffer, len);
        return  true;
    }

