nathanlnw/tw705_nx_gsm_v1.0/bsp/stm32f207VC_tw705/app_712/protocol_808/Device_808.c
    return false;
}

u8   Api_RecordNum_Read( u8 *name, u8 Rec_Num, u8 *buffer, u16 len)  //  Rec_Num<128  Len<128
{

    if(strcmp((const char *)name, event_808) == 0)
    {
        DF_ReadFlash(DF_Event_Page + Rec_Num, 0, buffer, len);
        // DF_delay_ms(10);
        return true;
    }
    if(strcmp((const char *)name, msg_broadcast) == 0)
    {
        DF_ReadFlash(DF_Broadcast_offset + Rec_Num, 0, buffer, len);
        //DF_delay_ms(10);
        return true;
    }
    if(strcmp((const char *)name, phonebook) == 0)
    {
        DF_ReadFlash(DF_PhoneBook_Page + Rec_Num, 0, buffer, len);
        //DF_delay_ms(10);
        return true;
    }
    if(strcmp((const char *)name, Rail_cycle) == 0)
    {
        DF_ReadFlash(DF_Event_Page + Rec_Num, 0, buffer, len);
        // DF_delay_ms(10);
        return true;
    }
    if(strcmp((const char *)name, Rail_rect) == 0)
    {
        DF_ReadFlash(DF_RectangleRail_Page + Rec_Num, 0, buffer, len);
        // DF_delay_ms(10);
        return true;
    }
    if(strcmp((const char *)name, Rail_polygen) == 0)
    {
        DF_ReadFlash(DF_PolygenRail_Page + Rec_Num, 0, buffer, len);
        //DF_delay_ms(10);
        return true;
    }
    if(strcmp((const char *)name, turn_point) == 0)
    {
        DF_ReadFlash(DF_turnPoint_Page + Rec_Num, 0, buffer, len);
        // DF_delay_ms(10);
        return true;
    }
    if(strcmp((const char *)name, route_line) == 0)
    {
        DF_ReadFlash(DF_Route_Page + Rec_Num, 0, buffer, len);
        DF_delay_ms(10);
        return true;
    }
    if(strcmp((const char *)name, ask_quesstion) == 0)
    {
        DF_ReadFlash(DF_AskQuestion_Page + Rec_Num, 0, buffer, len);
        return true;
    }
    if(strcmp((const char *)name, text_msg) == 0)
    {
        DF_ReadFlash(DF_Msg_Page + Rec_Num, 0, buffer, len);
        //DF_delay_ms(10);
        return true;
    }
    if(strcmp((const char *)name, pic_index) == 0)
    {
        DF_ReadFlash(DF_PicIndex_Page + Rec_Num, 0, buffer, len);
        return true;
    }
    if(strcmp((const char *)name, voice_index) == 0)
    {
        DF_ReadFlash(DF_SoundIndex_Page + Rec_Num, 0, buffer, len);
        //DF_delay_ms(10);
        return  true;
    }
    return false;

}

void  Api_WriteInit_var_rd_wr(void)    //   写初始化话各类型读写记录地址
{
    DF_Write_RecordAdd(cycle_write, cycle_read, TYPE_CycleAdd);
    DF_delay_ms(50);
#ifdef AVRG15MIN
    DF_Write_RecordAdd(Avrg_15minSpd.write, Avrg_15minSpd.read, TYPE_15minSpd);
    DF_delay_ms(50);
#endif
    DF_Write_RecordAdd(Distance_m_u32, DayStartDistance_32, TYPE_DayDistancAdd);
#ifdef SPD_WARN_SAVE
    DF_Write_RecordAdd(ExpSpdRec_write, ExpSpdRec_read, TYPE_ExpSpdAdd);
#endif
    DF_delay_ms(50);
}
void  Api_Read_var_rd_wr(void)    //   读初始化话各类型读写记录地址
{
    DF_Read_RecordAdd(cycle_write, cycle_read, TYPE_CycleAdd);
    DF_delay_ms(50);
#ifdef AVRG15MIN
    DF_Read_RecordAdd(Avrg_15minSpd.write, Avrg_15minSpd.read, TYPE_15minSpd);
#endif

    DF_Read_RecordAdd(Distance_m_u32, DayStartDistance_32, TYPE_DayDistancAdd);
#ifdef SPD_WARN_SAVE
    DF_Read_RecordAdd(ExpSpdRec_write, ExpSpdRec_read, TYPE_ExpSpdAdd);
#endif
    DF_delay_ms(50);
}


//----------   TF 卡检查状态
u8     TF_Card_Status(void)
{
    //    1:  succed             0:  fail
    return 0 ;

}
//===============================================================

u8  DF_Write_RecordAdd(u32 Wr_Address, u32 Rd_Address, u8 Type)
{
    u8     head[448];
    u16    offset = 0;
    u16    Add_offset = 0; //  page offset
    u16    Savepage = 0;    // 存储page 页
    u16    InpageOffset = 0; // 页内偏移
    u8     reg[9];
    u8     Flag_used = 0x01;

    //  1.   Classify
    switch(Type)
    {
    case TYPE_CycleAdd:
        Add_offset = DF_CycleAdd_Page;
        break;
    case TYPE_PhotoAdd:
        Add_offset = DF_PhotoAdd_Page;
        break;
#ifdef SPD_WARN_SAVE
    case TYPE_ExpSpdAdd:
        Add_offset = DF_ExpSpdAdd_Page;
        break;
#endif
    case TYPE_15minSpd:
        Add_offset = DF_Minpos_Page;
        break;
    case TYPE_DayDistancAdd:
        Add_offset = DF_DayDistance_Page;
        break;
    default :
        return false;
    }
    //  2 .  Excute

    DF_ReadFlash(Add_offset, 0, (unsigned char *)head, 448);
    DF_delay_us(100);

    /*

      通过查询Block 第1个Page的前448字节是否为0xFF 判断，计算出要写入内容的偏移地址，当448都标识使用完后，擦除该Block。
      然后从头开始。
     由于每个page能存64个内容，所以要先计算存储的Page然后再计算偏移地址
      存储page的计算方法为 ：
            Savepage=Startpage+n/64;
     存储页内的偏移地址计算方法为：
    	   InpageOffset=（n%64）*8；

    */
    for(offset = 0; offset < 448; offset++)
    {
        if(0xFF == head[offset])
            break;
    }

    if(offset == 448)
    {
        SST25V_SectorErase_4KByte((8 * ((u32)Add_offset / 8))*PageSIZE); // Erase block
        offset = 0;
        DF_delay_ms(50);
    }
    Savepage = Add_offset + 1 + (offset >> 6); //Add_offset+offset/64
    InpageOffset = ((offset % 64) << 3); //(offset%64）*8;


    memcpy(reg, &Wr_Address, 4);
    memcpy(reg + 4, &Rd_Address, 4);

    DF_WriteFlashDirect(Add_offset, offset, &Flag_used, 1); //  更新状态位
    DF_delay_us(100);
    DF_WriteFlashDirect(Savepage, InpageOffset, reg, 8); //  更新记录内容

    return true;
    //                 The  End
}


u8  DF_Read_RecordAdd(u32 Wr_Address, u32 Rd_Address, u8 Type)
{
    u8	   head[448];
    u16    offset = 0;
    u32   Add_offset = 0; //  page offset
    u32   Reg_wrAdd = 0, Reg_rdAdd = 0;
    u16    Savepage = 0;    // 存储page 页
    u16    InpageOffset = 0; // 页内偏移

    //Wr_Address, Rd_Address  , 没有什么用只是表示输入，便于写观察而已
    //  1.   Classify
    switch(Type)
    {
    case TYPE_CycleAdd:
        Add_offset = DF_CycleAdd_Page;
        break;
    case TYPE_PhotoAdd:
        Add_offset = DF_PhotoAdd_Page;
        break;
#ifdef SPD_WARN_SAVE
    case TYPE_ExpSpdAdd:
        Add_offset = DF_ExpSpdAdd_Page;
        break;
#endif
    case TYPE_15minSpd:
        Add_offset = DF_Minpos_Page;
        break;
    case TYPE_DayDistancAdd:
        Add_offset = DF_DayDistance_Page;
        break;
    default :
        return false;

