nathanlnw/tw705_nx_gsm_v1.0/bsp/stm32f207VC_tw705/app_712/protocol_808/Device_808.c
    }
    //  2 .  Excute

    DF_ReadFlash(Add_offset, 0, (unsigned char *)head, 448); //   读出信息

    /*

      通过查询Block 第1个Page的前448字节是否为0xFF 判断，计算出要写入内容的偏移地址，当448都标识使用完后，擦除该Block。
      然后从头开始。
     由于每个page能存64个内容，所以要先计算存储的Page然后再计算偏移地址
      存储page的计算方法为 ：
    		Savepage=Startpage+n/64;
     存储页内的偏移地址计算方法为：
    	   InpageOffset=（n%64）*8；

    */


    for(offset = 0; offset < 448; offset++)
    {
        if(0xFF == head[offset])
            break;
    }

    offset--;  // 第一个不会为0xFF


    Savepage = Add_offset + 1 + (offset >> 6);	 //Add_offset+offset/64
    InpageOffset = ((offset % 64) << 3); 	 //(offset%64）*8;
    //rt_kprintf("\r\n Read	offset=%d\r\n", offset);
    DF_ReadFlash(Savepage, InpageOffset, (u8 *)&Reg_wrAdd, 4);
    DF_ReadFlash(Savepage, InpageOffset + 4, (u8 *)&Reg_rdAdd, 4);


    // rt_kprintf("\r\n  RecordAddress  READ-1   write=%d , read=%d \r\n",Reg_wrAdd,Reg_rdAdd);


    //  3. Get reasult
    switch(Type)
    {
    case TYPE_CycleAdd:
        cycle_write = Reg_wrAdd;
        cycle_read = Reg_rdAdd;
        break;
#ifdef SPD_WARN_SAVE
    case TYPE_ExpSpdAdd:
        ExpSpdRec_write = Reg_wrAdd;
        ExpSpdRec_read = Reg_rdAdd;
        break;
#endif

#ifdef AVRG15MIN
    case TYPE_15minSpd:
        Avrg_15minSpd.write = Reg_wrAdd;
        Avrg_15minSpd.read = Reg_rdAdd;
        break;
#endif
    case TYPE_DayDistancAdd:
        Distance_m_u32 = Reg_wrAdd;
        DayStartDistance_32 = Reg_rdAdd;
        break;
    default :
        return false;

    }
    //                 The  End
    return true;
}




